aethaniel/emBlocks_sam_patch/share/em_armgcc/lib/atmel/atsam4/atsam4l/include/atsam4l.h
#ifndef _BDA100D8_6610_4AC1_A595_8009D54101CF_
#define _BDA100D8_6610_4AC1_A595_8009D54101CF_

#if defined __ATSAM4LC2A__
  #include "atsam4lc2a.h"
#elif defined __ATSAM4LC2B__
  #include "atsam4lc2b.h"
#elif defined __ATSAM4LC2C__
  #include "atsam4lc2c.h"
#elif defined __ATSAM4LC4A__
  #include "atsam4lc4a.h"
#elif defined __ATSAM4LC4B__
  #include "atsam4lc4b.h"
#elif defined __ATSAM4LC4C__
  #include "atsam4lc4c.h"
#elif defined __ATSAM4LC8A__
  #include "atsam4lc8a.h"
#elif defined __ATSAM4LC8B__
  #include "atsam4lc8b.h"
#elif defined __ATSAM4LC8C__
  #include "atsam4lc8c.h"
#elif defined __ATSAM4LS2A__
  #include "atsam4ls2a.h"
#elif defined __ATSAM4LS2B__
  #include "atsam4ls2b.h"
#elif defined __ATSAM4LS2C__
  #include "atsam4ls2c.h"
#elif defined __ATSAM4LS4A__
  #include "atsam4ls4a.h"
#elif defined __ATSAM4LS4B__
  #include "atsam4ls4b.h"
#elif defined __ATSAM4LS4C__
  #include "atsam4ls4c.h"
#elif defined __ATSAM4LS8A__
  #include "atsam4ls8a.h"
#elif defined __ATSAM4LS8B__
  #include "atsam4ls8b.h"
#elif defined __ATSAM4LS8C__
  #include "atsam4ls8c.h"
#else
  #error Device not supported.
#endif

#endif /* _BDA100D8_6610_4AC1_A595_8009D54101CF_ */
